<template>
  <div class="pageContainer">
    <div class="pageLine" v-for="(rule, index) in rules" :key="index">
      <div class="pageTitle">{{ index + 1 }}.</div>
      <div class="pageTitle">{{ rule.subject }}</div>
      <div class="pageContent"></div>
      <div class="pageContent" v-html="rule.content"></div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.pageContainer {
  width: 100%;
  height: 100%;
  padding: 0px 20px;
  display: grid;
  grid-template-columns: 1fr;
  row-gap: 30px;

  .pageLine {
    letter-spacing: 4px;
    display: grid;
    grid-template-columns: 30px auto;
    column-gap: 1px;
    row-gap: 10px;

    .pageTitle {
      font-size: 1.1rem;
      color: rgb(0, 132, 255);
    }

    .pageContent {
      color: rgb(150, 150, 150);
      text-align: justify;
    }
  }
}
</style>

<script setup lang="ts">
const rules = [
  {
    subject: '認知與接受條款',
    content:
      '華冠證券投資顧問股份有限公司（以下簡稱「華冠投顧」）係依據本服務條款提供華冠投顧網站（https://www.hwa-guan.com.tw）服務 (以下簡稱「本服務」)。當您使用本服務時，即表示您已閱讀、瞭解並同意接受本約定書之所有內容。華冠投顧有權於任何時間修改或變更本約定書之內容，建議您隨時注意該等修改或變更。您於任何修改或變更後繼續使用本服務，視為您已閱讀、瞭解並同意接受該等修改或變更。如果您不同意本約定書的內容，或者您所屬的國家或地域排除本約定書內容之全部或一部時，您應立即停止使用本服務。 若您為未滿十八歲，除應符合上述規定外，並應於您的家長（或監護人）同意、瞭解並同意本約定書之所有內容及其後修改變更後，方得使用或繼續使用本服務。當您使用或繼續使用本服務時，即表示您的家長（或監護人）已閱讀、瞭解並同意接受本約定書之所有內容及其後修改變更。'
  },
  {
    subject: '與第三人網站的連結',
    content:
      '本服務提供廣大投資朋友更高品質及更全方位的投資諮詢與顧問之服務，旨在便利您迅速獲得資訊。您可能會因此連結至其他業者經營的網站，但不表示華冠投顧與該等業者有任何關係。其他業者經營的網站均由各該業者自行負責，不屬華冠投顧控制及負責範圍之內。華冠投顧對資訊結果不擔保其合適性、可依賴性、即時性、有效性、正確性及完整性。'
  },
  {
    subject: '您的註冊義務',
    content:
      '為了能使用本網站服務，您同意以下事項： <br />(a) 依本服務註冊表之提示提供您本人正確、最新及完整的資料。 <br />(b)維持並更新您個人資料，確保其為正確、最新及完整。若您提供任何錯誤或不實的資料，華冠投顧有權暫停或終止您的帳號，並拒絕您使用本服務之全部或一部。'
  },
  {
    subject: '華冠投顧隱私權政策',
    content: '關於您的會員註冊以及其他特定資料依本公司「隱私權政策」受到保護與規範。'
  },
  {
    subject: '會員帳號、密碼及安全',
    content:
      '完成本服務的登記程序之後，您將收到一個密碼及帳號。維持密碼及帳號的機密安全，是您的責任。利用該密碼及帳號所進行的一切行動，您將負完全的責任。您並同意以下事項：<br />(a)您的密碼或帳號遭到盜用或有其他任何安全問題發生時，您將立即通知華冠投顧，且<br />(b)每次連線完畢，均結束您的帳號使用。'
  },
  {
    subject: '使用者的守法義務及承諾',
    content:
      '您承諾絕不為任何非法目的或以任何非法方式使用本服務，並承諾遵守中華民國相關法規及一切使用網際網路之國際慣例。您若係中華民國以外之使用者，並同意遵守所屬國家或地域之法令。您同意並保證不得利用本服務從事侵害他人權益或違法之行為，包括但不限於：<br />A. 侵害他人名譽、隱私權、營業秘密、商標權、著作權、專利權、其他智慧財產權及其他權利；<br />B. 違反依法律或契約所應負之保密義務；<br />C. 冒用他人名義使用本服務；<br />D. 傳輸或散佈電腦病毒；<br />E. 從事不法交易行為或張貼虛假不實、引人犯罪之訊息；<br />F. 其他華冠投顧有正當理由認為不適當之行為。'
  },
  {
    subject: '系統中斷或故障',
    content:
      '本服務有時可能會出現中斷或故障等現象，或許將造成您使用上的不便、資料喪失、錯誤、遭人篡改或其他經濟上損失等情形。您於使用本服務時宜自行採取防護措施。華冠投顧對於您因使用（或無法使用）本服務而造成的損害，不負任何賠償責任。'
  },
  {
    subject: '下載資料',
    content:
      '華冠投顧對於您於下載前自行斟酌與判斷資料之合適性、有效性、正確性、完整性、及是否侵害他人權利，以免遭受損失（例如：造成您電腦系統受損、或儲存資料流失等）；華冠投顧對於該等損失不負任何賠償責任。'
  },
  {
    subject: '關於使用一般措施',
    content:
      '您同意華冠投顧得就本服務訂定一般措施及限制，長時間未使用的帳號，華冠投顧有權關閉。您也同意，華冠投顧有權依其自行之考量，不論通知與否，隨時變更這些一般措施及限制。'
  },
  {
    subject: '資訊或建議',
    content:
      '華冠投顧對於您使用本服務或經由本服務連結之其他網站而取得之資訊或建議， 不擔保其為完全正確無誤。華冠投顧對於本服務所提供之資訊或建議有權隨時修改或刪除。 您在做出任何相關規劃與決定之前，仍應請教專業人員針對您的情況提出意見，以符合您的個別需求。<br />華冠投顧隨時會與其他公司、廠商等第三人（「內容提供者」）合作，由其提供不同內容供華冠投顧刊登， 華冠投顧於刊登時均將註明內容提供者。基於尊重內容提供者之智慧財產權，華冠投顧對其所提供之內容並不做實質之審查或修改， 對該等內容之正確真偽亦不負任何責任。對該等內容之正確真偽，您宜自行判斷之。您若認為某些內容涉及侵權或有所不實，請逕向該內容提供者反應意見。'
  },
  {
    subject: '買賣或其他交易行為',
    content:
      '您若係向華冠投顧進行買賣、服務或其他交易行為， 雙方權利義務將另行依據本服務網站之責任規範約定書內容決定之。'
  },
  {
    subject: '免責聲明',
    content:
      '您明確了解並同意： 華冠投顧不保證以下事項：(i)本服務將符合您的需求， (ii)本服務不受干擾、及時提供、安全可靠或免於出錯， (iii)由本服務之使用而取得之結果為正確或可靠， 及(iv)您經由本服務購買或取得之任何產品、服務、資訊或其他資料將符合您的期望。 是否經由本服務之使用下載或取得任何資料應由您自行考量且自負風險， 因前開任何資料之下載而導致您電腦系統之任何損壞或資料流失，您應負完全責任。 您自華冠投顧或經由本服務取得之建議和資訊，無論其為書面或口頭，均不構成本服務之保證。'
  },
  {
    subject: '金融相關服務',
    content:
      '本服務為提供金融相關資訊之目的。經由本服務傳送之任何資訊之正確性與適用性，您其後之任何交易或投資決定，華冠投顧亦不予負責。'
  },
  {
    subject: '會員行為',
    content:
      '在任何情況下，華冠投顧均不為任何「會員內容」負責，包含但不限於任何錯誤或遺漏，以及經由本服務張貼、發送電子郵件或傳送而衍生之任何損失或損害。 您了解華冠投顧並未針對「會員內容」事先加以審查，但華冠投顧有權（但無義務）依其自行之考量，拒絕或移除經由本服務提供之任何「會員內容」。 在不限制前開規定之前提下，華冠投顧及其指定人有權將違反本服務條款之任何「會員內容」加以移除。您使用任何「會員內容」時， 就前開「會員內容」之正確性、完整性或實用性之情形，您同意必須自行加以評估並承擔所有風險。 您了解並同意， 華冠投顧依據法律的要求，或基於以下目的之合理必要範圍內，認定必須將「會員內容」加以保存或揭露予政府機關、司法警察或未成年人之監護人時， 得加以保存及揭露：<br />(a)遵守法令或政府機關之要求律程序，<br />(b)執行本服務條款，<br />(c)回應任何侵害第三人權利之主張， 或<br />(d)保護華冠投顧及其使用者及公眾之權利、財產或個人安全。'
  },
  {
    subject: '智慧財產權的保護',
    content:
      '華冠投顧所使用之軟體或程式、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計， 均由華冠投顧或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。 任何人不得逕自使用、修改、重製、公開播送、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。 若您欲引用或轉載前述軟體、程式或網站內容，必須依法取得華冠投顧或其他權利人的事前書面同意。 尊重智慧財產權是您應盡的義務，如有違反，您應對華冠投顧負損害賠償責任（包括但不限於訴訟費用及律師費用等）。'
  },
  {
    subject: '您對華冠投顧之授權',
    content:
      '若您無合法權利得授權他人使用、修改、重製、公開播送、改作、散布、發行、公開發表某資料， 並將前述權利轉授權第三人，請勿擅自將該資料上載、傳送、輸入或提供至華冠投顧。 任何資料一經您上載、傳送、輸入或提供至華冠投顧時， 視為您已允許華冠投顧可以基於公益或私益之目的，無條件使用、修改、重製、公開播送、改作、散布、發行、公開發表該等資料， 並得將前述權利轉授權他人， 您對此絕無異議。您並應保證華冠投顧使用、修改、重製、公開播送、改作、散布、發行、公開發表、轉授權該等資料， 不致侵害任何第三人之智慧財產權，否則應對華冠投顧負損害賠償責任（包括但不限於訴訟費用及律師費用等）。'
  },
  {
    subject: '拒絕或終止您的使用',
    content:
      '您同意華冠投顧得基於其自行之考量，因任何理由，包含但不限於缺乏使用，或華冠投顧認為您已經違反本服務條款的明文規定及精神， 終止您的密碼、帳號（或其任何部分）或本服務之使用，並將本服務內任何「會員內容」加以移除並刪除。華冠投顧亦得依其自行之考量， 於通知或未通知之情形下，隨時終止本服務或其任何部分。您同意依本服務條款任何規定提供之本服務，無需進行事先通知即得終止， 您承認並同意，華冠投顧得立即關閉或刪除您的帳號及您帳號中所有相關資料及檔案，及停止本服務之使用。此外， 您同意若本服務之使用被終止，華冠投顧對您或任何第三人均不承擔責任。'
  },
  {
    subject: '準據法與管轄法院',
    content:
      '本約定書之解釋與適用，以及與本約定書有關的爭議，均應依照中華民國法律予以處理，並以台灣台北地方法院為第一審管轄法院。'
  }
]
</script>
